InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омНастройкиПолучитьЗаписать/Ext/Module.bsl
Функция ПолучитьНастройкиТЗКанбан(Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 
	
	стПараметры = ПолучитьСтруктуруТЗКанбан(); 
	ИмяНастройкиПроектыКанбанТЗ = "ПроектыКанбанТЗ";

	
	мПараметры = Новый Массив;
	Для каждого х Из стПараметры Цикл
		мПараметры.Добавить(х.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.Пользователь = &Пользователь
		|	И НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", мПараметры);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ИмяНастройкиПроектыКанбанТЗ = Выборка.ИмяНастройки Тогда
			стПараметры.ПроектыКанбанТЗ.Добавить(Выборка.Значение);
		Иначе
			стПараметры[Выборка.ИмяНастройки] = Выборка.Значение;
		КонецЕсли;
	КонецЦикла;

	Возврат стПараметры;

КонецФункции // ПолучитьНастройкиТЗКанбан()

Функция ПолучитьСтруктуруТЗКанбан() Экспорт

	стПараметры = Новый Структура();
	
	стПараметры.Вставить("ШиринаКолонкиТЗКанбан", 	240);
	стПараметры.Вставить("РазмерШрифтаТЗКанбан", 	16);
	стПараметры.Вставить("СортировкаТЗКанбан", 		0);
	стПараметры.Вставить("ПроектыКанбанТЗ", 		Новый Массив);
	
	Возврат стПараметры;

КонецФункции // ПолучитьСтруктуруТЗКанбан()

Процедура ЗаписатьНастройкиКанбанТЗ(стПараметры, Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 

	ИмяНастройки = "ПроектыКанбанТЗ";

	мПараметры = Новый Массив;
	Для каждого х Из стПараметры Цикл
		
		Если х.Ключ = ИмяНастройки Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.ИмяНастройки 	= х.Ключ;
		МенеджерЗаписи.НомерНастройки 	= 0;
		МенеджерЗаписи.Пользователь 	= Пользователь;
		МенеджерЗаписи.Значение			= х.Значение;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	
	НаборЗаписей = РегистрыСведений.НастройкиПроекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИмяНастройки.Установить(ИмяНастройки);
	
	НомерНастройки = 0;
	
	Для каждого Значение Из стПараметры[ИмяНастройки] Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Значение 		= Значение;
		НоваяЗапись.НомерНастройки 	= НомерНастройки;
		НоваяЗапись.ИмяНастройки 	= ИмяНастройки;
		НоваяЗапись.Пользователь 	= Пользователь;
		
		НомерНастройки = НомерНастройки + 1;
	
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры

Функция ПолучитьСтруктуруГантКонструктора() Экспорт

	стПараметры = Новый Структура();
	
	стПараметры.Вставить("Проект", 			Справочники.Проекты.ПустаяСсылка());
	стПараметры.Вставить("Подразделение", 	Справочники.Подразделения.ПустаяСсылка());
	стПараметры.Вставить("Конструктор", 	Справочники.Пользователи.ПустаяСсылка());
	стПараметры.Вставить("Сортировка", 		0);
	
	Возврат стПараметры;


КонецФункции // ПолучитьСтруктуруГантКонструктора()

Функция ПолучитьНастройкиГантКонструктора(Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 
	
	стПараметры = ПолучитьСтруктуруГантКонструктора(); 
	ИмяНастройкиПроектыКанбанТЗ = "ГантКонструктора";

	
	мПараметры = Новый Массив;
	Для каждого х Из стПараметры Цикл
		мПараметры.Добавить(х.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.Пользователь = &Пользователь
		|	И НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", мПараметры);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ИмяНастройкиПроектыКанбанТЗ = Выборка.ИмяНастройки Тогда
			стПараметры.ПроектыКанбанТЗ.Добавить(Выборка.Значение);
		Иначе
			стПараметры[Выборка.ИмяНастройки] = Выборка.Значение;
		КонецЕсли;
	КонецЦикла;

	Возврат стПараметры;

КонецФункции // ПолучитьНастройкиТЗКанбан()

Процедура ЗаписатьНастройкиГантКонструктора(стПараметры, Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 

	ИмяНастройки = "ГантКонструктора";

	мПараметры = Новый Массив;
	Для каждого х Из стПараметры Цикл
		
		Если х.Ключ = ИмяНастройки Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.ИмяНастройки 	= х.Ключ;
		МенеджерЗаписи.НомерНастройки 	= 0;
		МенеджерЗаписи.Пользователь 	= Пользователь;
		МенеджерЗаписи.Значение			= х.Значение;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьНастройкуПользователя(ИмяНастройки, Пользователь = Неопределено, НомерНастройки = 0) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.Пользователь = &Пользователь
		|	И НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", 	ИмяНастройки);
	Запрос.УстановитьПараметр("Пользователь", 	Пользователь);
	Запрос.УстановитьПараметр("НомерНастройки", НомерНастройки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции // ПолучитьНастройкуПользователя() 

Процедура ЗаписатьНастройкуПользователя(ИмяНастройки, Значение, Пользователь = Неопределено, НомерНастройки = 0) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.ИмяНастройки 	= ИмяНастройки;
	МенеджерЗаписи.НомерНастройки 	= НомерНастройки;
	МенеджерЗаписи.Пользователь 	= Пользователь;
	МенеджерЗаписи.Значение			= Значение;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры  //ЗаписатьНастройкуПользователя
